In [1]:
import pandas as pd

In [2]:
obj = pd.Series([4, 7, -5, 3])

In [3]:
obj[obj%2==0]

0    4
dtype: int64

In [4]:
obj+5

0     9
1    12
2     0
3     8
dtype: int64

In [5]:
obj * 2

0     8
1    14
2   -10
3     6
dtype: int64

In [6]:
data = {"EWU": 1212, "DU": 1211, "KUET": 7455, "KU":7456}
obj1 = pd.Series(data)
obj1

EWU     1212
DU      1211
KUET    7455
KU      7456
dtype: int64

In [7]:
data = {"EWU": 1212, "DU": 1211, "KUET": 7455, "KUET":7456}
obj1 = pd.Series(data)
obj1

EWU     1212
DU      1211
KUET    7456
dtype: int64

In [8]:
data = {"EWU": 1212, "DU": 1211, "KUET": 7455, "KU":7455}
obj1 = pd.Series(data)
obj1
#Value Mutable
#Key ImMutable

EWU     1212
DU      1211
KUET    7455
KU      7455
dtype: int64

In [9]:
list1 = [['Ripa', 12, 3.5, 10.2], ['Fariha', 13, 15, 20.2], ['Sharmin', 22, 16.2, 7.0002]]
df = pd.DataFrame(list1)
df.columns = ['Name', 'Age', 'Street', 'Number']
df

      Name  Age  Street   Number
0     Ripa   12     3.5  10.2000
1   Fariha   13    15.0  20.2000
2  Sharmin   22    16.2   7.0002

In [10]:
dict1 = {'id': [1, 2, 3], 'name': ['Ripa', 'Fariha', 'Sharmin'], 'age': [20, 22, 21]}
df1 = pd.DataFrame(dict1)
df1

   id     name  age
0   1     Ripa   20
1   2   Fariha   22
2   3  Sharmin   21

In [11]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000,'Utah': 5000}
obj3 = pd.Series(sdata)
print(obj3)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [70]:
list1 = [['Alice',23,3.5,10],['Bob',24,3.4,6],['Charlie',22,3.9,8]]
df = pd.DataFrame(list1)
df.columns = ['Name','age','cgpa','hoursStudied']
print(df.head())

      Name  age  cgpa  hoursStudied
0    Alice   23   3.5            10
1      Bob   24   3.4             6
2  Charlie   22   3.9             8

In [39]:
df.describe()

        age      cgpa  hoursStudied
count   3.0  3.000000           3.0
mean   23.0  3.600000           8.0
std     1.0  0.264575           2.0
min    22.0  3.400000           6.0
25%    22.5  3.450000           7.0
50%    23.0  3.500000           8.0
75%    23.5  3.700000           9.0
max    24.0  3.900000          10.0

In [13]:
dict1 = {'id':[1,2,3],'name':['alice','bob','charlie'],'age':[20, 25, 32]}
df1 = pd.DataFrame(dict1)
print(df1)

   id     name  age
0   1    alice   20
1   2      bob   25
2   3  charlie   32

In [37]:
df1.describe()

        id        age
count  3.0   3.000000
mean   2.0  25.666667
std    1.0   6.027714
min    1.0  20.000000
25%    1.5  22.500000
50%    2.0  25.000000
75%    2.5  28.500000
max    3.0  32.000000

In [29]:
df2 = pd.read_csv('sample_data_1.csv')
df2

   1      Alabama   4779736  5.7
0  2       Alaska    710231  5.6
1  3      Arizona   6392017  4.7
2  4     Arkansas   2915918  5.6
3  5   California  37253956  4.4
4  6     Colorado   5029196  2.8
5  7  Connecticut   3574097  2.4
6  8     Delaware    897934  5.8

In [30]:
df2 = pd.read_csv('sample_data_1.csv')
df2.columns=['id','state','population','murder_rate']
df2

   id        state  population  murder_rate
0   2       Alaska      710231          5.6
1   3      Arizona     6392017          4.7
2   4     Arkansas     2915918          5.6
3   5   California    37253956          4.4
4   6     Colorado     5029196          2.8
5   7  Connecticut     3574097          2.4
6   8     Delaware      897934          5.8

In [31]:
df2.head() # displays first 5 rows

   id       state  population  murder_rate
0   2      Alaska      710231          5.6
1   3     Arizona     6392017          4.7
2   4    Arkansas     2915918          5.6
3   5  California    37253956          4.4
4   6    Colorado     5029196          2.8

In [32]:
df2.tail() # displays last 5 rows

   id        state  population  murder_rate
2   4     Arkansas     2915918          5.6
3   5   California    37253956          4.4
4   6     Colorado     5029196          2.8
5   7  Connecticut     3574097          2.4
6   8     Delaware      897934          5.8

In [33]:
df2.count() # displays number of values for each column

id             7
state          7
population     7
murder_rate    7
dtype: int64

In [34]:
df2 = pd.read_csv('sample_data_1.csv', header = None)
df2.columns=['id','state','population','murder_rate']
print(df2)
df2.head() # displays first 5 rows
df2.tail() # displays last 5 rows
df2.count() # displays number of values for each column

   id        state  population  murder_rate
0   1      Alabama     4779736          5.7
1   2       Alaska      710231          5.6
2   3      Arizona     6392017          4.7
3   4     Arkansas     2915918          5.6
4   5   California    37253956          4.4
5   6     Colorado     5029196          2.8
6   7  Connecticut     3574097          2.4
7   8     Delaware      897934          5.8

id             8
state          8
population     8
murder_rate    8
dtype: int64

In [38]:
df2.describe()

            id    population  murder_rate
count  8.00000  8.000000e+00     8.000000
mean   4.50000  7.694136e+06     4.625000
std    2.44949  1.210575e+07     1.350926
min    1.00000  7.102310e+05     2.400000
25%    2.75000  2.411422e+06     4.000000
50%    4.50000  4.176916e+06     5.150000
75%    6.25000  5.369901e+06     5.625000
max    8.00000  3.725396e+07     5.800000

In [48]:
df2.iloc[1]['state']

'Alaska'

In [58]:
print(df2.iloc[0]['population'])
print(df2.iloc[0]['state'])

4779736
Alabama

In [57]:
df3 = df2[['state', 'population']]
df3

         state  population
0      Alabama     4779736
1       Alaska      710231
2      Arizona     6392017
3     Arkansas     2915918
4   California    37253956
5     Colorado     5029196
6  Connecticut     3574097
7     Delaware      897934

In [54]:
df4 = df2.iloc[1:2]
df4

   id   state  population  murder_rate
1   2  Alaska      710231          5.6

In [55]:
df4 = df2.iloc[1:3]
df4

   id    state  population  murder_rate
1   2   Alaska      710231          5.6
2   3  Arizona     6392017          4.7

In [56]:
df4 = df2.loc[1:3]
df4

   id     state  population  murder_rate
1   2    Alaska      710231          5.6
2   3   Arizona     6392017          4.7
3   4  Arkansas     2915918          5.6

In [59]:
df4 = df2.loc[1:3, ['state', 'id']]
df4

      state  id
1    Alaska   2
2   Arizona   3
3  Arkansas   4

In [65]:
df4 = df2.iloc[3:]
df4

   id        state  population  murder_rate
3   4     Arkansas     2915918          5.6
4   5   California    37253956          4.4
5   6     Colorado     5029196          2.8
6   7  Connecticut     3574097          2.4
7   8     Delaware      897934          5.8

In [66]:
df4 = df2.iloc[:3]
df4

   id    state  population  murder_rate
0   1  Alabama     4779736          5.7
1   2   Alaska      710231          5.6
2   3  Arizona     6392017          4.7

In [71]:
df5 = df.append(df1)
df5

      Name  age  cgpa  hoursStudied   id     name
0    Alice   23   3.5          10.0  NaN      NaN
1      Bob   24   3.4           6.0  NaN      NaN
2  Charlie   22   3.9           8.0  NaN      NaN
0      NaN   20   NaN           NaN  1.0    alice
1      NaN   25   NaN           NaN  2.0      bob
2      NaN   32   NaN           NaN  3.0  charlie

In [72]:
df5 = df.append(df2)
df5

,Name,age,cgpa,hoursStudied,id,state,population,murder_rate
0,Alice,23.0,3.5,10.0,NaN,NaN,NaN,NaN
1,Bob,24.0,3.4,6.0,NaN,NaN,NaN,NaN
2,Charlie,22.0,3.9,8.0,NaN,NaN,NaN,NaN
0,NaN,NaN,NaN,NaN,1.0,Alabama,4779736.0,5.7
1,NaN,NaN,NaN,NaN,2.0,Alaska,710231.0,5.6
2,NaN,NaN,NaN,NaN,3.0,Arizona,6392017.0,4.7
3,NaN,NaN,NaN,NaN,4.0,Arkansas,2915918.0,5.6
4,NaN,NaN,NaN,NaN,5.0,California,37253956.0,4.4
5,NaN,NaN,NaN,NaN,6.0,Colorado,5029196.0,2.8
6,NaN,NaN,NaN,NaN,7.0,Connecticut,3574097.0,2.4
7,NaN,NaN,NaN,NaN,8.0,Delaware,897934.0,5.8

In [73]:
df5 = df1.append(df2)
df5

   id     name   age        state  population  murder_rate
0   1    alice  20.0          NaN         NaN          NaN
1   2      bob  25.0          NaN         NaN          NaN
2   3  charlie  32.0          NaN         NaN          NaN
0   1      NaN   NaN      Alabama   4779736.0          5.7
1   2      NaN   NaN       Alaska    710231.0          5.6
2   3      NaN   NaN      Arizona   6392017.0          4.7
3   4      NaN   NaN     Arkansas   2915918.0          5.6
4   5      NaN   NaN   California  37253956.0          4.4
5   6      NaN   NaN     Colorado   5029196.0          2.8
6   7      NaN   NaN  Connecticut   3574097.0          2.4
7   8      NaN   NaN     Delaware    897934.0          5.8

In [74]:
df5 = df.append(df1, ignore_index = True)
df5

      Name  age  cgpa  hoursStudied   id     name
0    Alice   23   3.5          10.0  NaN      NaN
1      Bob   24   3.4           6.0  NaN      NaN
2  Charlie   22   3.9           8.0  NaN      NaN
3      NaN   20   NaN           NaN  1.0    alice
4      NaN   25   NaN           NaN  2.0      bob
5      NaN   32   NaN           NaN  3.0  charlie

In [75]:
df5.drop([0,1])

      Name  age  cgpa  hoursStudied   id     name
2  Charlie   22   3.9           8.0  NaN      NaN
3      NaN   20   NaN           NaN  1.0    alice
4      NaN   25   NaN           NaN  2.0      bob
5      NaN   32   NaN           NaN  3.0  charlie

In [78]:
df5.drop(['cgpa', axis= , inplace = True])
df5

SyntaxError: invalid syntax (<ipython-input-78-147ed570f57c>, line 1)

In [40]:
print(df1.iloc[0][0])
print(df1.loc[0]['name'])

1
alice

In [41]:
df3=df1[['name','cgpa']]
print(df3)

KeyError: "['cgpa'] not in index"

In [ ]:
df4 = df1.loc[1:2]
print(df4)
df5 = df1.iloc[1:3]
print(df5)

In [42]:
df4 = df1.loc[1:2,['name','age']]
print(df4)
df5 = df1.iloc[1:3,[0,1]]
print(df5)

      name  age
1      bob   25
2  charlie   32
   id     name
1   2      bob
2   3  charlie

In [43]:
list1 = [['Alice',23,3.5,10],['Bob',24,3.4,6],['Charlie',22,3.9,8]]
df = pd.DataFrame(list1)
df.columns = ['name','age','cgpa','hoursStudied']
list2 = [['Don',21,2.5,2],['Elton',25,2.75,4]]
df11 = pd.DataFrame(list2)
df11.columns = ['name','age','cgpa','hoursStudied']
df12 = df.append(df11, ignore_index=True)
print(df12)

      name  age  cgpa  hoursStudied
0    Alice   23  3.50            10
1      Bob   24  3.40             6
2  Charlie   22  3.90             8
3      Don   21  2.50             2
4    Elton   25  2.75             4

In [44]:
df12.drop([0,1], inplace=True)
df12.drop(['cgpa'], axis=1, inplace=True)

In [45]:
new_cols = ['n','a','hs']
df12.columns=new_cols
print(df12)

         n   a  hs
2  Charlie  22   8
3      Don  21   2
4    Elton  25   4

In [46]:
cgpa_greater_than_three_point_five1 = df1[df1['cgpa'] > 3.5]
cgpa_greater_than_three_point_five2 = df1.loc[df1['cgpa'] > 3.5]
cgpa_greater_than_three_point_five3 = df1.query('cgpa > 3.5')

print(cgpa_greater_than_three_point_five1)
print(cgpa_greater_than_three_point_five2)
print(cgpa_greater_than_three_point_five3)
df1.sort_values(by='age',ascending=False)

KeyError: 'cgpa'